<template>
    <view id="app">
		<uni-nav-bar title="直通车投放服务协议" left-icon="back" @clickLeft="back"></uni-nav-bar>
        <view class="aggrement-section">
			<view class="title">搜索引擎签约推广服务电子协议（又名《直通车协议》）</view>
			<view class="title"></view>
            <view>甲方：江西搜搜信息科技有限公司</view>
            <view>乙方：交纳直通车推广费用的会员</view>
            <view>甲乙双方本着互惠互利、发展共赢的原则，按照《中华人民共和国合同法》及相关法律的规定，就甲方向乙方提供搜索引擎推广服务事宜，经友好协商，达成如下协议，以资共同遵守：</view>
            <view class="aggrement-section">
                <view class="title">一、服务项目</view>
                <view>1.1 甲方为乙方在搜索引擎（包括百度或360）上推广乙方的个人网站。</view>
                <view>1.2 在服务期限内，乙方委托甲方对乙方的个人网站进行优化、推广，来提高乙方个人网站的访问量、知名度及美誉度。</view>
            </view>
			<view class="aggrement-section">
				<view class="title">二、服务期限与终止条件</view>
				<view>2.1 本协议约定的服务是以收费方式提供的，服务期限由乙方交纳的推广服务费决定。</view>
                <view>2.2 乙方账户内的推广服务费使用完毕后应在24小时内完成充值，如果乙方逾期未充值，则本合同解除，双方的权利义务终止。</view>
				<view>2.3 甲方根据乙方要求和市场反馈，可开发其他增值服务；甲方有权收取相应增值服务费，乙方有权决定是否购买该增值服务。</view>
				<view>
					2.4 甲方提供的网络服务，一旦为乙方的个人站进行搜索引擎推广，便付出大量的工作，提供相应的服务；乙方承诺，在协议期限内，如因个人情况和其他因素影响，乙方要求终止服务或者解除合同，均不得主张返回按约预付的推广服务费。
				</view>
			</view>
			<view class="aggrement-section">
				<view class="title">三、权利和义务</view>
				<view>3.1 乙方在开通搜索引擎推广服务前，已经与企业签订相关经销商协议，是已得到企业授权的商家。</view>
                <view>3.2 乙方必须是实名认证过的正式会员，并且在正式会员的有效期间内，乙方支付推广服务费后，享有甲方提供的搜索引擎推广服务。</view>
				<view>3.3 搜索引擎推广由甲方专业的推广团队负责，以增加乙方个人网站的浏览量，甲方为乙方提供搜索引擎推广服务，对乙方的销售业绩不承担责任。</view>
				<view>
					3.4 乙方在服务期限内，不管交易金额大小，独享与顾客交易所带来的全部利润，甲方不得收取或扣取乙方的任何费用。
				</view>
				<view>
					3.5 乙方应自觉遵守相关法律法规，不得散布或传播谣言、有悖社会公德、危害行业发展的不良信息；甲方有权按照国家相关法律要求，对乙方发布的违法、违规以及有悖社会道德的信息进行删除。
				</view>
				<view>
					3.6 乙方个人网站里面的图片、文字等内容为乙方授权甲方上传、更新，对此甲方不负责审查，若涉及侵权或不正当竞争行为，由乙方承担责任。
				</view>
				<view>
					3.7 乙方应为每一位顾客提供优质的产品和服务，不得销售任何假冒伪劣产品，不得实施恶性价格竞争等违法行为；因乙方产品瑕疵造成甲方宣传与乙方产品不符，其责任由乙方承担，如因此导致甲方遭受损失的，乙方应予赔偿。
				</view>
				<view>
					3.7 乙方应为每一位顾客提供优质的产品和服务，不得销售任何假冒伪劣产品，不得实施恶性价格竞争等违法行为；因乙方产品瑕疵造成甲方宣传与乙方产品不符，其责任由乙方承担，如因此导致甲方遭受损失的，乙方应予赔偿。
				</view>
				<view>
					3.8 甲方接到消费者举报乙方借助本网站销售假冒伪劣产品，经甲方核实情况属实，甲方有权关闭乙方的网站，并不再退还乙方按约预付的推广服务费；乙方的行为造成甲方损失的，乙方应予赔偿。
				</view>
				<view>
					3.9 乙方自愿选择加入搜索引擎签约推广项目，因乙方原因导致搜索引擎链接不到乙方个人网站的，甲方不承担责任。
				</view>
				<view>
					3.10 乙方享受搜索引擎服务所带来的广阔顾客资源，有当地顾客咨询乙方所属品牌商品及事业信息时，甲方为乙方提供顾客推介服务。
				</view>
				<view>
					3.11 乙方承诺：其经营模式符合中华人民共和国现行法律、法规规定。如乙方按照《商业特许经营管理条例》的规定属于特许经营的，应确保已向商务主管部门办理完毕相关备案手续。
				</view>
				<view>
					3.11 乙方承诺：其经营模式符合中华人民共和国现行法律、法规规定。如乙方按照《商业特许经营管理条例》的规定属于特许经营的，应确保已向商务主管部门办理完毕相关备案手续。
				</view>
				<view>
					3.12 乙方违反上述承诺，如经营模式违法、违规，按照《特许经营管理条例》等相关的规定应当办理特许经营备案而未办理的，并因此导致乙方被主管部门处罚或与其他方存在纠纷的，将由乙方承担责任，甲方不对此承担任何责任，如因此连带甲方遭受损失的，乙方应向甲方承担赔偿责任。
				</view>
				<view>
					3.13 因与乙方相关的第三方违反中华人民共和国现行法律、法规规定，如按照《特许经营管理条例》等相关的规定应当办理特许经营备案而未办理的，并因此导致乙方被主管部门处罚或与其他方存在纠纷的，给乙方造成损失的，甲方不对此承担任何责任，如因此连带甲方遭受损失的，乙方应向甲方承担赔偿责任。
				</view>
			</view>
			<view class="aggrement-section">
				<view class="title">四、特别约定</view>
				<view>
					4.1 甲方通过网络提供服务，应当依照法律、行政法规的规定和国家标准的强制性要求，采取技术措施和其他必要措施，保障网络安全、稳定运行；但鉴于互联网的特殊性质，加上现有网络技术的局限性，甲方在提供网络服务过程中，可能遇到甲乙双方不能预见、不能避免并不能克服的客观情况，乙方同意并承诺，遇下列情形之一的，甲方不承担责任：
				</view>
				<view class="agg-item">
					（1）网站受到黑客等恶意程序攻击引起的数据丢失、泄漏等情况，导致乙方搜索引擎推广服务不能进行的；<br>
					（2）因运营商技术调整导致搜索引擎推广服务受到影响的；<br>
					（3）因搜索引擎平台对其服务内容、版面布局、页面设计等进行调整而影响推广服务业务的；<br>
					（4）网站，服务器停机维护等造成网络不能正常运营的；<br>
					（5）其他不能预见、不能避免并不能克服的客观情况。<br>
				</view>
				<view class="title">五、本协议最终解释权归江西搜搜信息科技有限公司所有。</view>
			</view>
        </view>
    </view>
</template>

<script>
import uniNavBar from "@/components/uni-nav-bar/uni-nav-bar.vue";
export default {
	components: {
		uniNavBar
	},
    data() {
        return {
			order_sn: ''
		};
	},
	onLoad(option) {
		this.order_sn = option.order_sn
	},
	methods: {
		// 返回上级页面
		back() {
			uni.redirectTo({
				url: '/pages/train/train_pay?order_sn='+this.order_sn
			})
		},
	}
};
</script>

<style lang="scss">
#app {
    padding: 0rpx 20rpx 40rpx;
    background-color: #fff;
    font-size: 26rpx;

    .aggrement-section {
        line-height: 1.5;

        .title {
            font-weight: bold;
            font-size: 28rpx;
            line-height: 60rpx;
        }

        .agg-item {
            font-size: 24rpx;
            color: #665656;
        }
    }
}
</style>
